"""Задания по стилю кода и именованию переменных."""

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None
id(spam) == id(eggs)

# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым
python101_students = []

# назови переменную, которая хранит текущее количество студентов в потоке
python101_current_students = 45

# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45
min_of_range = 1
max_of_range = 45

# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
PI = 3.1415926535
